Revit 2027 API
IViewSheetSet.OrderedViewList Property
 Ordered views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
IReadOnlyList<View> OrderedViewList { get; set; }
Property OrderedViewList As IReadOnlyList(Of View)
	Get
	Set
property IReadOnlyList<View^>^ OrderedViewList {
	IReadOnlyList<View^>^ get ();
	void set (IReadOnlyList<View^>^ value);
}
abstract OrderedViewList : IReadOnlyList<View> with get, set
Property Value
IReadOnlyList<View>
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input ordered view list is null.
InvalidOperationException |  Thrown when the set operation failed due to invalid view which cannot be printed.
See Also
Reference
IViewSheetSet Interface
Autodesk.Revit.DB Namespace